Revit 2024 API
RebarShapeConstraintSagittaLength Constructor
 Create a constraint to drive sagitta length.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public RebarShapeConstraintSagittaLength(
	ElementId paramId
)
Visual Basic
Public Sub New ( _
	paramId As ElementId _
)
Visual C++
public:
RebarShapeConstraintSagittaLength(
	ElementId^ paramId
)
Parameters
paramId
Type: Autodesk.Revit.DB.ElementId
 The Id of a Rebar Shape parameter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  paramId is not a valid Element identifier.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarShapeConstraintSagittaLength Class
Autodesk.Revit.DB.Structure Namespace